<?xml version="1.0"?>
<net name="torch_jit" version="11">
	<layers>
		<layer id="0" name="images" type="Parameter" version="opset1">
			<data shape="42,3,224,224" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="images">
					<dim>42</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="/Expand_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="42, 1, 1024" offset="0" size="86016" />
			<output>
				<port id="0" precision="FP16" names="/Expand_output_0">
					<dim>42</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="/Expand" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>42</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>42</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="patch_embed.proj.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1024, 3, 14, 14" offset="86016" size="1204224" />
			<output>
				<port id="0" precision="FP16" names="patch_embed.proj.weight">
					<dim>1024</dim>
					<dim>3</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="patch_embed.proj.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1024</dim>
					<dim>3</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1024</dim>
					<dim>3</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="/patch_embed/proj/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="14, 14" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>42</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1024</dim>
					<dim>3</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>42</dim>
					<dim>1024</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Reshape_356_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1024, 1, 1" offset="1290240" size="2048" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Reshape_356" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="/patch_embed/proj/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>42</dim>
					<dim>1024</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/patch_embed/proj/Conv_output_0">
					<dim>42</dim>
					<dim>1024</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant_12310" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="1292288" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="/patch_embed/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>42</dim>
					<dim>1024</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/patch_embed/Reshape_output_0">
					<dim>42</dim>
					<dim>1024</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Constant_374" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="1292312" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="/patch_embed/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>42</dim>
					<dim>1024</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/patch_embed/Transpose_output_0">
					<dim>42</dim>
					<dim>256</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="/Concat_1" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>42</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>42</dim>
					<dim>256</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Concat_1_output_0">
					<dim>42</dim>
					<dim>257</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="/Cast_1_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 257, 1024" offset="1292336" size="526336" />
			<output>
				<port id="0" precision="FP16" names="/Cast_1_output_0">
					<dim>1</dim>
					<dim>257</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="/Cast_1" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>257</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>257</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>42</dim>
					<dim>257</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>257</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Add_output_0">
					<dim>42</dim>
					<dim>257</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_11983_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 3072" offset="1818672" size="6144" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Constant_11983" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3072</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Range_450" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1824816" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="MVN_451" type="MVN" version="opset6">
			<data eps="9.9999999747524271e-07" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>42</dim>
					<dim>257</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>42</dim>
					<dim>257</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Constant_11981_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1024" offset="1824824" size="2048" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Constant_11981" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Multiply_452" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>42</dim>
					<dim>257</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>42</dim>
					<dim>257</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Constant_11982_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1024" offset="1826872" size="2048" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Constant_11982" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="/blocks.0/norm1/LayerNormalization" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>42</dim>
					<dim>257</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/norm1/LayerNormalization_output_0">
					<dim>42</dim>
					<dim>257</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Transpose_7207_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="3072, 1024" offset="1828920" size="6291456" />
			<output>
				<port id="0" precision="FP16">
					<dim>3072</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Transpose_7207" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>3072</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>3072</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="/blocks.0/attn/qkv/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>42</dim>
					<dim>257</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>3072</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/attn/qkv/MatMul_output_0">
					<dim>42</dim>
					<dim>257</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="/blocks.0/attn/qkv/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3072</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>42</dim>
					<dim>257</dim>
					<dim>3072</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/attn/qkv/Add_output_0">
					<dim>42</dim>
					<dim>257</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="/blocks.0/attn/Concat" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="8120376" size="40" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/blocks.0/attn/Concat_output_0">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="/blocks.0/attn/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>42</dim>
					<dim>257</dim>
					<dim>3072</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/attn/Reshape_output_0">
					<dim>42</dim>
					<dim>257</dim>
					<dim>3</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Constant_476" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="8120416" size="40" />
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="/blocks.0/attn/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>42</dim>
					<dim>257</dim>
					<dim>3</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/attn/Transpose_output_0">
					<dim>3</dim>
					<dim>42</dim>
					<dim>16</dim>
					<dim>257</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="8120456" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_output_0" />
			</output>
		</layer>
		<layer id="36" name="Constant_478" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="8120456" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="37" name="/blocks.0/attn/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>42</dim>
					<dim>16</dim>
					<dim>257</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/blocks.0/attn/Gather_output_0">
					<dim>42</dim>
					<dim>16</dim>
					<dim>257</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Constant_11984_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="8120464" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Constant_11984" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="/blocks.0/attn/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>42</dim>
					<dim>16</dim>
					<dim>257</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/attn/Mul_output_0">
					<dim>42</dim>
					<dim>16</dim>
					<dim>257</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="/patch_embed/proj/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="8120466" size="8" />
			<output>
				<port id="0" precision="I64" names="/patch_embed/proj/Constant_output_0" />
			</output>
		</layer>
		<layer id="42" name="Constant_482" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="8120456" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="43" name="/blocks.0/attn/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>42</dim>
					<dim>16</dim>
					<dim>257</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/blocks.0/attn/Gather_1_output_0">
					<dim>42</dim>
					<dim>16</dim>
					<dim>257</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="/patch_embed/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="8120474" size="8" />
			<output>
				<port id="0" precision="I64" names="/patch_embed/Constant_output_0" />
			</output>
		</layer>
		<layer id="45" name="Constant_484" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="8120456" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="46" name="/blocks.0/attn/Gather_2" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>42</dim>
					<dim>16</dim>
					<dim>257</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/blocks.0/attn/Gather_2_output_0">
					<dim>42</dim>
					<dim>16</dim>
					<dim>257</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Constant_7272_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="8120482" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="48" name="Constant_7272" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="49" name="Constant_7271_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="8120484" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="50" name="Constant_7271" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="51" name="/blocks.0/attn/MatMul_1" type="ScaledDotProductAttention" version="opset13">
			<data causal="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>42</dim>
					<dim>16</dim>
					<dim>257</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>42</dim>
					<dim>16</dim>
					<dim>257</dim>
					<dim>64</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>42</dim>
					<dim>16</dim>
					<dim>257</dim>
					<dim>64</dim>
				</port>
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32" names="/blocks.0/attn/MatMul_1_output_0">
					<dim>42</dim>
					<dim>16</dim>
					<dim>257</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Constant_491" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="8120486" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="/blocks.0/attn/Transpose_2" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>42</dim>
					<dim>16</dim>
					<dim>257</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/attn/Transpose_2_output_0">
					<dim>42</dim>
					<dim>257</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="/blocks.0/attn/Concat_1" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="8120518" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/blocks.0/attn/Concat_1_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="/blocks.0/attn/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>42</dim>
					<dim>257</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/attn/Reshape_1_output_0">
					<dim>42</dim>
					<dim>257</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Transpose_7289_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1024, 1024" offset="8120542" size="2097152" />
			<output>
				<port id="0" precision="FP16">
					<dim>1024</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Transpose_7289" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1024</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1024</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="/blocks.0/attn/proj/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>42</dim>
					<dim>257</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1024</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/attn/proj/MatMul_output_0">
					<dim>42</dim>
					<dim>257</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Constant_11985_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1024" offset="10217694" size="2048" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Constant_11985" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Multiply_11628" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>42</dim>
					<dim>257</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>42</dim>
					<dim>257</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Constant_11986_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1024" offset="10219742" size="2048" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Constant_11986" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="/blocks.0/ls1/Mul" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>42</dim>
					<dim>257</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/ls1/Mul_output_0">
					<dim>42</dim>
					<dim>257</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="/blocks.0/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>42</dim>
					<dim>257</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>42</dim>
					<dim>257</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/Add_output_0">
					<dim>42</dim>
					<dim>257</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Constant_11989_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 4096" offset="10221790" size="8192" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>4096</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Constant_11989" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>4096</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>4096</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Range_510" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1824816" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="MVN_511" type="MVN" version="opset6">
			<data eps="9.9999999747524271e-07" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>42</dim>
					<dim>257</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>42</dim>
					<dim>257</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Constant_11987_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1024" offset="10229982" size="2048" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Constant_11987" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Multiply_512" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>42</dim>
					<dim>257</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>42</dim>
					<dim>257</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Constant_11988_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1024" offset="10232030" size="2048" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Constant_11988" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="/blocks.0/norm2/LayerNormalization" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>42</dim>
					<dim>257</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/norm2/LayerNormalization_output_0">
					<dim>42</dim>
					<dim>257</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Transpose_7334_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="4096, 1024" offset="10234078" size="8388608" />
			<output>
				<port id="0" precision="FP16">
					<dim>4096</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Transpose_7334" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>4096</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>4096</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="/blocks.0/mlp/fc1/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>42</dim>
					<dim>257</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>4096</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/mlp/fc1/MatMul_output_0">
					<dim>42</dim>
					<dim>257</dim>
					<dim>4096</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="/blocks.0/mlp/fc1/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>4096</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>42</dim>
					<dim>257</dim>
					<dim>4096</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/mlp/fc1/Add_output_0">
					<dim>42</dim>
					<dim>257</dim>
					<dim>4096</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="/blocks.0/mlp/act/Mul_1" type="Gelu" version="opset7">
			<data approximation_mode="ERF" />
			<input>
				<port id="0" precision="FP32">
					<dim>42</dim>
					<dim>257</dim>
					<dim>4096</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/blocks.0/mlp/act/Mul_1_output_0">
					<dim>42</dim>
					<dim>257</dim>
					<dim>4096</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Transpose_7351_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1024, 4096" offset="18622686" size="8388608" />
			<output>
				<port id="0" precision="FP16">
					<dim>1024</dim>
					<dim>4096</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Transpose_7351" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1024</dim>
					<dim>4096</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1024</dim>
					<dim>4096</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="/blocks.0/mlp/fc2/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>42</dim>
					<dim>257</dim>
					<dim>4096</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1024</dim>
					<dim>4096</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/mlp/fc2/MatMul_output_0">
					<dim>42</dim>
					<dim>257</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Constant_11990_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1024" offset="27011294" size="2048" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Constant_11990" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Multiply_11632" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>42</dim>
					<dim>257</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>42</dim>
					<dim>257</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Constant_11991_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1024" offset="27013342" size="2048" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Constant_11991" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="/blocks.0/ls2/Mul" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>42</dim>
					<dim>257</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/ls2/Mul_output_0">
					<dim>42</dim>
					<dim>257</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="/blocks.0/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>42</dim>
					<dim>257</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>42</dim>
					<dim>257</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/Add_1_output_0">
					<dim>42</dim>
					<dim>257</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Constant_11994_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 3072" offset="27015390" size="6144" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Constant_11994" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3072</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Range_535" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="1824816" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="MVN_536" type="MVN" version="opset6">
			<data eps="9.9999999747524271e-07" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>42</dim>
					<dim>257</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>42</dim>
					<dim>257</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Constant_11992_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1024" offset="27021534" size="2048" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Constant_11992" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Multiply_537" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>42</dim>
					<dim>257</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>42</dim>
					<dim>257</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Constant_11993_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1024" offset="27023582" size="2048" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Constant_11993" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="/blocks.1/norm1/LayerNormalization" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>42</dim>
					<dim>257</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.1/norm1/LayerNormalization_output_0">
					<dim>42</dim>
					<dim>257</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Transpose_7396_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="3072, 1024" offset="27025630" size="6291456" />
			<output>
				<port id="0" precision="FP16">
					<dim>3072</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Transpose_7396" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>3072</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>3072</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="/blocks.1/attn/qkv/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>42</dim>
					<dim>257</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>3072</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.1/attn/qkv/MatMul_output_0">
					<dim>42</dim>
					<dim>257</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="/blocks.1/attn/qkv/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3072</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>42</dim>
					<dim>257</dim>
					<dim>3072</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.1/attn/qkv/Add_output_0">
					<dim>42</dim>
					<dim>257</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="/blocks.1/attn/Concat" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="8120376" size="40" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/blocks.1/attn/Concat_output_0">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="/blocks.1/attn/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>42</dim>
					<dim>257</dim>
					<dim>3072</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.1/attn/Reshape_output_0">
					<dim>42</dim>
					<dim>257</dim>
					<dim>3</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Constant_559" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="8120416" size="40" />
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="/blocks.1/attn/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>42</dim>
					<dim>257</dim>
					<dim>3</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.1/attn/Transpose_output_0">
					<dim>3</dim>
					<dim>42</dim>
					<dim>16</dim>
					<dim>257</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Constant_561" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="8120456" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="110" name="/blocks.1/attn/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>42</dim>
					<dim>16</dim>
					<dim>257</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/blocks.1/attn/Gather_output_0">
					<dim>42</dim>
					<dim>16</dim>
					<dim>257</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Constant_11995_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="8120464" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Constant_11995" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="/blocks.1/attn/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>42</dim>
					<dim>16</dim>
					<dim>257</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.1/attn/Mul_output_0">
					<dim>42</dim>
					<dim>16</dim>
					<dim>257</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Constant_565" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="8120456" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="115" name="/blocks.1/attn/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>42</dim>
					<dim>16</dim>
					<dim>257</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/blocks.1/attn/Gather_1_output_0">
					<dim>42</dim>
					<dim>16</dim>
					<dim>257</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="Constant_567" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="8120456" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="117" name="/blocks.1/attn/Gather_2" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>42</dim>
					<dim>16</dim>
					<dim>257</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/blocks.1/attn/Gather_2_output_0">
					<dim>42</dim>
					<dim>16</dim>
					<dim>257</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="Constant_7455_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="8120482" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="119" name="Constant_7455" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="120" name="Constant_7454_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="8120484" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="121" name="Constant_7454" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="122" name="/blocks.1/attn/MatMul_1" type="ScaledDotProductAttention" version="opset13">
			<data causal="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>42</dim>
					<dim>16</dim>
					<dim>257</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>42</dim>
					<dim>16</dim>
					<dim>257</dim>
					<dim>64</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>42</dim>
					<dim>16</dim>
					<dim>257</dim>
					<dim>64</dim>
				</port>
				<port id="3" precision="FP32" />
